# FailedToStoreSideFace Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..FailedToStoreSideFace Property
BuiltInFailures..::..WallFailures Class See Also
---
Failed to store wall side face. Wall sweeps on this wall will fail to regenerate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedToStoreSideFace { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedToStoreSideFace As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedToStoreSideFace {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace